perf/results/ping/ping_gunicorn.log

> perf@1.0.0 artillery /Users/mmariotti/Documents/UBA/1c20-tp-1/perf
> artillery "run" "ping.yaml" "-e" "gunicorn"

Started phase 0 (Ramp), duration: 30s @ 01:31:59(-0300) 2020-05-20
Report @ 01:32:09(-0300) 2020-05-20
Elapsed time: 10 seconds
  Scenarios launched:  77
  Scenarios completed: 77
  Requests completed:  77
  Mean response/sec: 7.88
  Response time (msec):
    min: 3.9
    max: 10.5
    median: 5.3
    p95: 7.1
    p99: 10
  Codes:
    200: 77

Report @ 01:32:19(-0300) 2020-05-20
Elapsed time: 20 seconds
  Scenarios launched:  135
  Scenarios completed: 135
  Requests completed:  135
  Mean response/sec: 13.53
  Response time (msec):
    min: 4
    max: 18
    median: 5.1
    p95: 8
    p99: 11.3
  Codes:
    200: 135

Report @ 01:32:29(-0300) 2020-05-20
Elapsed time: 30 seconds
  Scenarios launched:  171
  Scenarios completed: 171
  Requests completed:  171
  Mean response/sec: 17.19
  Response time (msec):
    min: 3.6
    max: 7.3
    median: 5.4
    p95: 6.7
    p99: 7
  Codes:
    200: 171

Started phase 1 (Plain), duration: 120s @ 01:32:29(-0300) 2020-05-20
Report @ 01:32:39(-0300) 2020-05-20
Elapsed time: 40 seconds
  Scenarios launched:  199
  Scenarios completed: 199
  Requests completed:  199
  Mean response/sec: 19.92
  Response time (msec):
    min: 3.5
    max: 12.8
    median: 4.7
    p95: 6.1
    p99: 7.6
  Codes:
    200: 199

Report @ 01:32:49(-0300) 2020-05-20
Elapsed time: 50 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.6
    max: 7.7
    median: 4.7
    p95: 5.6
    p99: 7.1
  Codes:
    200: 200

Report @ 01:32:59(-0300) 2020-05-20
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.6
    max: 13.6
    median: 4.8
    p95: 6
    p99: 7.4
  Codes:
    200: 200

Report @ 01:33:09(-0300) 2020-05-20
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.6
    max: 11.5
    median: 5
    p95: 6.8
    p99: 8.9
  Codes:
    200: 200

Report @ 01:33:19(-0300) 2020-05-20
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.6
    max: 11.7
    median: 5
    p95: 6.9
    p99: 10.7
  Codes:
    200: 200

Report @ 01:33:29(-0300) 2020-05-20
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20.02
  Response time (msec):
    min: 3.8
    max: 16.9
    median: 4.9
    p95: 6.8
    p99: 11.1
  Codes:
    200: 200

Report @ 01:33:39(-0300) 2020-05-20
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.9
    max: 12.6
    median: 5
    p95: 6.4
    p99: 10.6
  Codes:
    200: 200

Report @ 01:33:49(-0300) 2020-05-20
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.7
    max: 12.9
    median: 4.5
    p95: 7.2
    p99: 9.3
  Codes:
    200: 200

Report @ 01:33:59(-0300) 2020-05-20
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.8
    max: 10
    median: 5
    p95: 6.3
    p99: 9.4
  Codes:
    200: 200

Report @ 01:34:09(-0300) 2020-05-20
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.8
    max: 12.6
    median: 5
    p95: 6.5
    p99: 9
  Codes:
    200: 200

Report @ 01:34:19(-0300) 2020-05-20
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.8
    max: 14.1
    median: 5
    p95: 6.9
    p99: 10.2
  Codes:
    200: 200

Report @ 01:34:29(-0300) 2020-05-20
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.8
    max: 12.8
    median: 4.9
    p95: 7
    p99: 10.4
  Codes:
    200: 200

Report @ 01:34:30(-0300) 2020-05-20
Elapsed time: 2 minutes, 31 seconds
  Scenarios launched:  9
  Scenarios completed: 9
  Requests completed:  9
  Mean response/sec: 9.89
  Response time (msec):
    min: 4.1
    max: 7
    median: 5.3
    p95: 7
    p99: 7
  Codes:
    200: 9

All virtual users finished
Summary report @ 01:34:30(-0300) 2020-05-20
  Scenarios launched:  2791
  Scenarios completed: 2791
  Requests completed:  2791
  Mean response/sec: 18.52
  Response time (msec):
    min: 3.5
    max: 18
    median: 5
    p95: 6.7
    p99: 9.8
  Scenario counts:
    ping: 2791 (100%)
  Codes:
    200: 2791