perf/results/ping/ping_node.log

> perf@1.0.0 artillery /Users/mmariotti/Documents/UBA/1c20-tp-1/perf
> artillery "run" "ping.yaml" "-e" "node"

Started phase 0 (Ramp), duration: 30s @ 01:26:18(-0300) 2020-05-20
Report @ 01:26:28(-0300) 2020-05-20
Elapsed time: 10 seconds
  Scenarios launched:  73
  Scenarios completed: 73
  Requests completed:  73
  Mean response/sec: 7.36
  Response time (msec):
    min: 3.3
    max: 24.9
    median: 5
    p95: 5.9
    p99: 20.7
  Codes:
    200: 73

Report @ 01:26:38(-0300) 2020-05-20
Elapsed time: 20 seconds
  Scenarios launched:  126
  Scenarios completed: 126
  Requests completed:  126
  Mean response/sec: 12.61
  Response time (msec):
    min: 3.6
    max: 8.3
    median: 4.9
    p95: 6.1
    p99: 7.4
  Codes:
    200: 126

Report @ 01:26:48(-0300) 2020-05-20
Elapsed time: 30 seconds
  Scenarios launched:  169
  Scenarios completed: 169
  Requests completed:  169
  Mean response/sec: 16.92
  Response time (msec):
    min: 3.4
    max: 10.1
    median: 5
    p95: 6.2
    p99: 9.1
  Codes:
    200: 169

Started phase 1 (Plain), duration: 120s @ 01:26:48(-0300) 2020-05-20
Report @ 01:26:58(-0300) 2020-05-20
Elapsed time: 40 seconds
  Scenarios launched:  199
  Scenarios completed: 199
  Requests completed:  199
  Mean response/sec: 19.92
  Response time (msec):
    min: 3.3
    max: 13.9
    median: 4.4
    p95: 5.8
    p99: 9.7
  Codes:
    200: 199

Report @ 01:27:08(-0300) 2020-05-20
Elapsed time: 50 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.4
    max: 11.3
    median: 4.5
    p95: 5.6
    p99: 6.7
  Codes:
    200: 200

Report @ 01:27:18(-0300) 2020-05-20
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.2
    max: 7.9
    median: 4.3
    p95: 5.8
    p99: 7
  Codes:
    200: 200

Report @ 01:27:28(-0300) 2020-05-20
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.4
    max: 13.3
    median: 4.4
    p95: 5.5
    p99: 10.7
  Codes:
    200: 200

Report @ 01:27:38(-0300) 2020-05-20
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.4
    max: 16.8
    median: 4.5
    p95: 5.9
    p99: 11.8
  Codes:
    200: 200

Report @ 01:27:48(-0300) 2020-05-20
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.4
    max: 8.2
    median: 4.4
    p95: 6.6
    p99: 7.6
  Codes:
    200: 200

Report @ 01:27:58(-0300) 2020-05-20
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.6
    max: 12.6
    median: 4.5
    p95: 6.6
    p99: 11
  Codes:
    200: 200

Report @ 01:28:08(-0300) 2020-05-20
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.3
    max: 19.3
    median: 4.6
    p95: 6.1
    p99: 12.6
  Codes:
    200: 200

Report @ 01:28:18(-0300) 2020-05-20
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.6
    max: 11.5
    median: 4.8
    p95: 6.3
    p99: 8.4
  Codes:
    200: 200

Report @ 01:28:28(-0300) 2020-05-20
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.4
    max: 10.9
    median: 4.6
    p95: 6.4
    p99: 10.1
  Codes:
    200: 200

Report @ 01:28:38(-0300) 2020-05-20
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.4
    max: 15.3
    median: 4.5
    p95: 6
    p99: 9.9
  Codes:
    200: 200

Report @ 01:28:48(-0300) 2020-05-20
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 3.5
    max: 79.6
    median: 4.5
    p95: 6.6
    p99: 24.3
  Codes:
    200: 200

Report @ 01:28:49(-0300) 2020-05-20
Elapsed time: 2 minutes, 31 seconds
  Scenarios launched:  9
  Scenarios completed: 9
  Requests completed:  9
  Mean response/sec: 9.89
  Response time (msec):
    min: 4.2
    max: 8.6
    median: 4.7
    p95: 8.6
    p99: 8.6
  Codes:
    200: 9

All virtual users finished
Summary report @ 01:28:49(-0300) 2020-05-20
  Scenarios launched:  2776
  Scenarios completed: 2776
  Requests completed:  2776
  Mean response/sec: 18.4
  Response time (msec):
    min: 3.2
    max: 79.6
    median: 4.6
    p95: 6.1
    p99: 9.9
  Scenario counts:
    ping: 2776 (100%)
  Codes:
    200: 2776